/******************************************/
/*                 key.c                  */
/*                                        */
/*         水晶之约中的键盘函数库         */
/*                                        */
/*             编译环境DJGPP              */
/*                                        */
/*        编译需allegro V4.1.13支持       */
/*                                        */
/*           Cat Tom 12.5.2003            */
/******************************************/


/*键按下后等待抬起*/
void PressKey(int ScanCode)
{
 while( key[ScanCode] );
}
