/******************************************/
/*                 rpg.h                  */
/*                                        */
/*        水晶之约中的游戏状态参数        */
/*                                        */
/*             编译环境DJGPP              */
/*                                        */
/*        编译需allegro V4.1.13支持       */
/*                                        */
/*           Cat Tom  1.8.2003            */
/******************************************/

#define GAMERUN  1
#define GAMEQUIT 0


#define randnum(a)  rand()%a

/******************************************************************/

char GameFlag=GAMERUN;
